""" Напишите программу для печати всех уникальных значений в словаре.
Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
{"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII":" S007 "}]
Output: {'S005', 'S002', 'S007', 'S001', 'S009'} """

list_dict = [{"V": "S001"}, {"V": "S002"},
             {"VI": "S001"}, {"VI": "S005"},
             {"VII": " S005 "}, {"V": " S009 "},
             {"VIII": " S007 "}]

print(set([list(i.values())[0].strip() for i in list_dict]))

# list - преобращование в список
#  i.values() - возвращают список всех значений, доступных в данном словаре.
# [0] - обращаемся к элементу
# .strip() - убирает лишние пробелы
# set - тип данных который убирает дубликаты
# 

