"""Дан массив, состоящий из целых чисел. Напишите программу, которая в данном массиве определит
количество элементов, у которых два соседних и, при этом, оба соседних элемента меньше данного. Сначала
вводится число N — количество элементов в массиве Далее записаны N чисел — элементы массива. Массив
состоит из целых чисел.
Ввод:                       Ввод:
5                           5
1 2 3 4 5                   1 5 1 5 1
Вывод:                      Вывод:
0                           2
 """

_ = input()
nums = [int(i) for i in input().split()]

count = 0
for i in range(1, len(nums) - 1):
    if nums[i] == max(nums[i - 1: i + 2]): # max - поиск наибольшего. [i - 1: i + 2] - срез (число до и число после num[i])
        count += 1                          # В данном случае функция пройдет по всем элементам, сравнимая его (больше ли он) с рядом стоящими (указано срезом)

print(count)

# ------------------------- 2 вариант

print(len([i for i in range(1, len(nums) - 1) if nums[i - 1] < nums[i] > nums[i + 1]])) # [] -это потому что мы даем ф-ции len список, длинну которого надо посчитать

# --------------------- 3 

print(len([i for i in range(1, len(nums) - 1) if nums[i] == max(nums[i - 1: i + 2])]))